<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\TranslationLoader\LanguageLine;

class TranslationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            'header' => [
                'create-design' => [
                    'en' => '',
                    'uk' => 'Створити свій дизайн'
                ],
                'download-stickers' => [
                    'en' => '',
                    'uk' => 'Завантажити наліпки'
                ]
            ],
            'first-section' => [
                'title' => [
                    'en' => '',
                    'uk' => 'Плюсуй своє, купуючи українське'
                ],
                'subtitle' => [
                    'en' => '',
                    'uk' => 'В середньому до 40% вартості українських товарів повертається в країну'
                ]
            ],
            'when-buy' => [
                'title' => [
                    'en' => '',
                    'uk' => 'Коли купуєш українське <br>— плюсуєш своє*'
                ],
                'text' => [
                    'en' => '',
                    'uk' => 'Ми щодня вибираємо, що купити. Але кожна витрачена гривня може
                    працювати ще ефективніше, адже коли ми купуємо українське, то в
                    середньому до 40% від вартості повернеться до держави й дасть більше
                    можливостей для підтримки наших міст, наших людей і тих, хто нас
                    захищає'
                ],
                'title-2' => [
                    'en' => '',
                    'uk' => 'Чому так?'
                ],
                'text-2' => [
                    'en' => '',
                    'uk' => 'Бо купуючи український сир, ковбасу, косметику, куртку або керамічну
                    плитку, ми справді платимо зарплати людям на виробництві, оренду
                    власникам складських і торгових приміщень, робимо внесок у пенсію
                    нашим батькам і забезпечуємо можливість фінансування армії.'
                ],
                'title-3' => [
                    'en' => '',
                    'uk' => 'А ще!'
                ],
                'text-3' => [
                    'en' => '',
                    'uk' => 'А ще посилюємо український бізнес і робимо економіку стійкішою, щоб
                    країна була сильною та перемагала. Ні, це не означає, що однією
                    покупкою ми розв\'язуємо всі проблеми. Але коли так роблю я, ти, наші
                    родичі, друзі, сусіди та колеги, то це вже система — і тоді ми
                    посилюємо одне одного та Україну. Плюсуй своє — купуй українське.'
                ]
            ],
            'refund' => [
                'title' => [
                    'en' => '',
                    'uk' => 'Як кошти повертаються у державу'
                ],
                'card-1-title' => [
                    'en' => '',
                    'uk' => '1. Вироблення сировини'
                ],
                'card-1-description' => [
                    'en' => '',
                    'uk' => 'Вирощування, видобуток, первинна переробка'
                ],
                'card-1-percent' => [
                    'en' => '',
                    'uk' => '50%'
                ],
                'card-1-description-2' => [
                    'en' => '',
                    'uk' => 'Додана вартості продукту, виробленого в Україні'
                ],
                'card-1-percent-2' => [
                    'en' => '',
                    'uk' => '~35%'
                ],
                'card-1-percent-2-text' => [
                    'en' => '',
                    'uk' => 'Може не бути'
                ],
                'card-1-description-3' => [
                    'en' => '',
                    'uk' => 'Доданої вартості продукту, виробленого за кордоном'
                ],
                'card-2-title' => [
                    'en' => '',
                    'uk' => '2. Вхідна логістика'
                ],
                'card-2-description' => [
                    'en' => '',
                    'uk' => 'Постачання сировини, комплектуючих та інших первинних матеріалів для процесу виробництва'
                ],
                'card-2-percent' => [
                    'en' => '',
                    'uk' => '4%'
                ],
                'card-2-description-2' => [
                    'en' => '',
                    'uk' => 'Додана вартості продукту, виробленого в Україні'
                ],
                'card-2-percent-2' => [
                    'en' => '',
                    'uk' => '0%'
                ],
                'card-2-percent-2-text' => [
                    'en' => '',
                    'uk' => 'Не відбувається в країні'
                ],
                'card-2-description-3' => [
                    'en' => '',
                    'uk' => 'Доданої вартості продукту, виробленого за кордоном'
                ],
                'card-3-title' => [
                    'en' => '',
                    'uk' => '3. Процес виробництва'
                ],
                'card-3-description' => [
                    'en' => '',
                    'uk' => 'Створення кінцевого продукту'
                ],
                'card-3-percent' => [
                    'en' => '',
                    'uk' => '40%'
                ],
                'card-3-description-2' => [
                    'en' => '',
                    'uk' => 'Додана вартості продукту, виробленого в Україні'
                ],
                'card-3-percent-2' => [
                    'en' => '',
                    'uk' => '0%'
                ],
                'card-3-percent-2-text' => [
                    'en' => '',
                    'uk' => 'Не відбувається в країні'
                ],
                'card-3-description-3' => [
                    'en' => '',
                    'uk' => 'Доданої вартості продукту, виробленого за кордоном'
                ],
                'card-4-title' => [
                    'en' => '',
                    'uk' => '4. Вихідна логістика'
                ],
                'card-4-description' => [
                    'en' => '',
                    'uk' => 'Зберігання та переміщення кінцевого продукту та від кінця виробничої лінії до кінцевого споживача'
                ],
                'card-4-percent' => [
                    'en' => '',
                    'uk' => '6%'
                ],
                'card-4-description-2' => [
                    'en' => '',
                    'uk' => 'Додана вартості продукту, виробленого в Україні'
                ],
                'card-4-percent-2' => [
                    'en' => '',
                    'uk' => '~11%'
                ],
                'card-4-percent-2-text' => [
                    'en' => '',
                    'uk' => 'Може не бути'
                ],
                'card-4-description-3' => [
                    'en' => '',
                    'uk' => 'Доданої вартості продукту, виробленого за кордоном'
                ],
                'card-5-title' => [
                    'en' => '',
                    'uk' => '5. Споживання населенням'
                ],
                'card-6-title' => [
                    'en' => '',
                    'uk' => '6. Переробка'
                ],
                'card-6-description' => [
                    'en' => '',
                    'uk' => 'Вторинна переробка та утилізація відходів'
                ],
            ],
            'our-design' => [
                'title' => [
                    'en' => '',
                    'uk' => 'Шукай у супермаркетах товари зі знаком “Плюсуй своє”.'
                ],
                'description' => [
                    'en' => '',
                    'uk' => 'Товари з цим маркуванням вироблені в Україні, а значить у середньому до 40% від їхньої вартості повертається у країну в вигляді податків, зборів і зарплат.'
                ],
            ],
            'manufacturer' => [
                'title' => [
                    'en' => '',
                    'uk' => 'Ви представляєте українського виробника?'
                ],
                'description' => [
                    'en' => '',
                    'uk' => 'Ми розробили маркування для товарів українського виробництва і запрошуємо виробників приєднуватись до його використання на пакуванні та в рекламних матеріалах.'
                ],
                'card-1-title' => [
                    'en' => '',
                    'uk' => 'Завантажуйте макети наліпок для подальшого друку та використання.'
                ],
                'card-1-btn' => [
                    'en' => '',
                    'uk' => 'Завантажити наліпки'
                ],
                'card-1-description' => [
                    'en' => '',
                    'uk' => 'Там ви знайдете: PNG / AI / PSD'
                ],
                'card-2-title' => [
                    'en' => '',
                    'uk' => 'Згенеруйте собі такий же банер у декілька кроків лише за пару хвилин'
                ],
                'card-2-btn' => [
                    'en' => '',
                    'uk' => 'Створити свій дизайн'
                ],
                'card-2-description' => [
                    'en' => '',
                    'uk' => 'Знадобиться ваш логотип у PNG'
                ],
                'bottom-description' => [
                    'en' => '',
                    'uk' => 'Використовуючи логотип “Плюсуй своє” та згенеровані з ним рекламні матеріали, компанія дає згоду на обробку даних і внесення її до реєстру українських виробників.'
                ]
            ],
            'partners' => [
                'description' => [
                    'en' => '',
                    'uk' => 'Цей вебресурс створений за підтримки USAID / UK Aid проєкту «Прозорість та підзвітність у державному управлінні та послугах / TAPAS»'
                ]
            ],
            'footer' => [
                'tag-1' => [
                    'en' => '',
                    'uk' => '#ПЛЮСУЙСВОЄ'
                ],
                'tag-2' => [
                    'en' => '',
                    'uk' => '#ПЛЮСУЙУКРАЇНСЬКЕ'
                ],
                'btn-1' => [
                    'en' => '',
                    'uk' => 'Завантажити наліпки'
                ],
                'btn-2' => [
                    'en' => '',
                    'uk' => 'Створити свій дизайн'
                ],
                'copyright' => [
                    'en' => '',
                    'uk' => '<span class="footer-copyright-text">Весь контент доступний за ліцензією</span><a class="footer-copyright-link" href="#">
                                Creative Commons Attribution 4.0 International license,
                            </a><span class="footer-copyright-text">якщо не зазначено інше.</span>'
                ]
            ]
        ];

        foreach ($data as $groupKey => $groupData) {
            foreach ($groupData as $key => $translation) {
                LanguageLine::query()->firstOrCreate([
                    'group' => $groupKey,
                    'key' => $key,
                ],
                [
                    'text' => $translation
                ]);
            }
        }
    }
}
